In [5]:
# Parsing Function in Pandas

In [6]:
import pandas as pd

# Reading .csv file

In [7]:
# Read a .csv file by using pd.read_csv

In [8]:

df = pd.read_csv('student.csv')

In [9]:
df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [10]:
df.describe

<bound method NDFrame.describe of     id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female>

#  Reading .xlsx file

In [11]:
# Read .xlsx file by using pd.read_excel()

In [12]:

df = pd.read_excel('student.xlsx')

In [13]:
df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [14]:
df.describe

<bound method NDFrame.describe of     id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob   Five    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow    Six    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female>

# Reading .json file

In [15]:
# Read a .json file bu using pd.read_json()

In [16]:

df = pd.read_json('example_2.json')

In [17]:
df.head()

                                                    quiz
maths  {'q1': {'question': '5 + 7 = ?', 'options': ['...
sport  {'q1': {'question': 'Which one is correct team...

In [18]:
df.describe

<bound method NDFrame.describe of                                                     quiz
maths  {'q1': {'question': '5 + 7 = ?', 'options': ['...
sport  {'q1': {'question': 'Which one is correct team...>

# Reading .sql file

In [63]:
# Reading a .db or sql file by pd.read_sql_query & pd.read_sql_table

In [64]:
import sqlite3

#Connect to Database
con = sqlite3.connect('courses') 
cur = con.cursor()

# Create Table
cur.execute('''CREATE TABLE IF NOT EXISTS COURSES
          ([course_id] INTEGER PRIMARY KEY, 
           [course_name] TEXT, 
           [fee] INTEGER, 
           [duration] TEXT, 
           [discount] INTEGER)''')

In [65]:
# Insert Few Records
cur.execute('''INSERT INTO COURSES (course_id, course_name, fee, duration, discount)
                VALUES (1,'Spark',25000,'50 Days', 2000),
                (2,'Pandas',20000,'35 Days', 1000),
                (3,'Java',15000,'35 Days', 800),
                (4,'Python',15000,'30 Days', 500),
                (5,'PHP',28000,'30 Days', 800)''') 
                    
# Commit Inserts
con.commit()

In [66]:
# Connect to the database
con = sqlite3.connect('courses') 

# Run SQL          
sql_query = pd.read_sql('SELECT * FROM COURSES', con)

# Convert SQL to DataFrame
df = pd.DataFrame(sql_query, columns = ['course_id', 'course_name', 'fee','duration','discount'])
print(df)

   course_id course_name    fee duration  discount
0          1       Spark  25000  50 Days      2000
1          2      Pandas  20000  35 Days      1000
2          3        Java  15000  35 Days       800
3          4      Python  15000  30 Days       500
4          5         PHP  28000  30 Days       800

In [67]:
# Run SQL          
sql_query = pd.read_sql_query('SELECT * FROM COURSES', con)

# Convert SQL to DataFrame
df = pd.DataFrame(sql_query, columns = ['course_id', 'course_name', 'fee','duration','discount'])
print(df)

   course_id course_name    fee duration  discount
0          1       Spark  25000  50 Days      2000
1          2      Pandas  20000  35 Days      1000
2          3        Java  15000  35 Days       800
3          4      Python  15000  30 Days       500
4          5         PHP  28000  30 Days       800

In [71]:
df.head()

   course_id course_name    fee duration  discount
0          1       Spark  25000  50 Days      2000
1          2      Pandas  20000  35 Days      1000
2          3        Java  15000  35 Days       800
3          4      Python  15000  30 Days       500
4          5         PHP  28000  30 Days       800

In [72]:
df.describe

<bound method NDFrame.describe of    course_id course_name    fee duration  discount
0          1       Spark  25000  50 Days      2000
1          2      Pandas  20000  35 Days      1000
2          3        Java  15000  35 Days       800
3          4      Python  15000  30 Days       500
4          5         PHP  28000  30 Days       800>

# Reading .pkl file

In [73]:
# Reading picle file by using pd.read_pickle

In [74]:
# dictionary of data 
dct = {'ID': {0: 23, 1: 43, 2: 12, 
            3: 13, 4: 67, 5: 89, 
            6: 90, 7: 56, 8: 34}, 
    'Name': {0: 'Ram', 1: 'Deep', 
                2: 'Yash', 3: 'Aman', 
                4: 'Arjun', 5: 'Aditya', 
                6: 'Divya', 7: 'Chalsea', 
                8: 'Akash' }, 
    'Marks': {0: 89, 1: 97, 2: 45, 3: 78, 
                4: 56, 5: 76, 6: 100, 7: 87, 
                8: 81}, 
    'Grade': {0: 'B', 1: 'A', 2: 'F', 3: 'C', 
                4: 'E', 5: 'C', 6: 'A', 7: 'B', 
                8: 'B'} 
    }

In [75]:
# forming dataframe 
data = pd.DataFrame(dct)

In [76]:

# using to_pickle function to form file 
# with name 'pickle_file' 
pd.to_pickle(data,'./pickle_file.pkl')

In [77]:
# unpickled the data by using the
# pd.read_pickle method
unpickled_data = pd.read_pickle("./pickle_file.pkl")
print(unpickled_data)

   ID     Name  Marks Grade
0  23      Ram     89     B
1  43     Deep     97     A
2  12     Yash     45     F
3  13     Aman     78     C
4  67    Arjun     56     E
5  89   Aditya     76     C
6  90    Divya    100     A
7  56  Chalsea     87     B
8  34    Akash     81     B